Z2Z-GuGu/Snowflake-6/software/CH32V003/00_Test_GPIO - 副本/User/main.c
#define io_send_1() GPIOD->BSHR=GPIO_Pin_5
#define io_send_0() GPIOD->BCR=GPIO_Pin_5
// ws2812 ctrl
void ws2812_send_bit(uint8_t data_bit)
{
    if(data_bit == 0){
        // ADD_N_NOPS(2);
        io_send_0();
        ADD_N_NOPS(40);
        io_send_1();
    }else{
        ADD_N_NOPS(20);
        io_send_0();
        ADD_N_NOPS(12);
        io_send_1();
    }
}

void TIM1_Dead_Time_Init(u16 arr, u16 psc, u16 ccp)
{
    GPIO_InitTypeDef        GPIO_InitStructure = {0};
    TIM_OCInitTypeDef       TIM_OCInitStructure = {0};
    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure = {0};
    TIM_BDTRInitTypeDef     TIM_BDTRInitStructure = {0};

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_TIM1 | RCC_APB2Periph_AFIO, ENABLE);
    GPIO_PinRemapConfig(GPIO_PartialRemap1_TIM1, ENABLE);

    /* TIM1_CH1N */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    GPIO_WriteBit(GPIOC, GPIO_Pin_6, 1);
    Delay_Ms(10);
    GPIO_WriteBit(GPIOC, GPIO_Pin_6, 0);
    Delay_Ms(10);

    TIM_TimeBaseInitStructure.TIM_Period = arr;
    TIM_TimeBaseInitStructure.TIM_Prescaler = psc;
    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(TIM1, &TIM_TimeBaseInitStructure);

    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_Pulse = ccp;
    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;
    TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_Low;
    TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
    TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCNIdleState_Reset;
    TIM_OC1Init(TIM1, &TIM_OCInitStructure);
    
    TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);

    TIM_CtrlPWMOutputs(TIM1, ENABLE);
    TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable);
    TIM_ARRPreloadConfig(TIM1, ENABLE);
    TIM_Cmd(TIM1, ENABLE);
}

        // while(!(TIM1->INTFR & TIM_IT_Update)){}
        // TIM1->CH1CVR = 44;
        // TIM1->INTFR &= 0xFFFE;
        // while(!(TIM1->INTFR & TIM_IT_Update)){}
        // TIM1->CH1CVR = 16;
        // TIM1->INTFR &= 0xFFFE;

void ws2812_send_Byte(uint8_t ws_byte)
{
    uint8_t i;
    for(i = 0; i < 8; i ++){
        while(!(TIM1->INTFR & TIM_IT_Update)){}
        if (ws_byte & 0x80) {
            TIM1->CH1CVR = 44;
        } else {
            TIM1->CH1CVR = 16;
        }
        TIM1->INTFR &= 0xFFFE;
        ws_byte <<= 1;
    }
}

#define LED_NUM         30
#define PIXEL_SIZE      3

//  {0x00, 0x00, 0x00},
//  { H  ,  S  ,  V  }
uint8_t ws2812_hsv_data[LED_NUM][PIXEL_SIZE] = {
/*              I                   B                   L                   T                   R        */
/* 0 */ {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00},
/* 1 */ {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00},
/* 2 */ {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00},
/* 3 */ {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00},
/* 4 */ {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00},
/* 5 */ {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00},
};

//  {0x00, 0x00, 0x00},
//  { G  ,  R  ,  B  }
uint8_t ws2812_sample_data[LED_NUM][PIXEL_SIZE] = {
/*              I                   B                   L                   T                   R        */
/* 0 */ {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00},
/* 1 */ {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00},
/* 2 */ {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00},
/* 3 */ {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00},
/* 4 */ {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00},
/* 5 */ {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00}, {0x00, 0x00, 0x00},
};

// uint8_t ws2812_sample_data[LED_NUM][PIXEL_SIZE] = {
// /*              I                   B                   L                   T                   R        */
// /* 0 */ {0x40, 0xff, 0x40}, {0x00, 0x00, 0x00}, {0x48, 0xe0, 0x80}, {0x80, 0xc0, 0xff}, {0x48, 0xe0, 0x80},
// /* 1 */ {0x40, 0xff, 0x40}, {0x00, 0x00, 0x00}, {0x48, 0xe0, 0x80}, {0x80, 0xc0, 0xff}, {0x48, 0xe0, 0x80},
// /* 2 */ {0x40, 0xff, 0x40}, {0x00, 0x00, 0x00}, {0x48, 0xe0, 0x80}, {0x80, 0xc0, 0xff}, {0x48, 0xe0, 0x80},
// /* 3 */ {0x40, 0xff, 0x40}, {0x00, 0x00, 0x00}, {0x48, 0xe0, 0x80}, {0x80, 0xc0, 0xff}, {0x48, 0xe0, 0x80},
// /* 4 */ {0x40, 0xff, 0x40}, {0x00, 0x00, 0x00}, {0x48, 0xe0, 0x80}, {0x80, 0xc0, 0xff}, {0x48, 0xe0, 0x80},
// /* 5 */ {0x40, 0xff, 0x40}, {0x00, 0x00, 0x00}, {0x48, 0xe0, 0x80}, {0x80, 0xc0, 0xff}, {0x48, 0xe0, 0x80},
// };

void ws2812_send_data(uint8_t *p_wsdata, uint16_t data_len)
{
    uint16_t i;
    uint8_t *p_data = p_wsdata;


    GPIOC->BCR=GPIO_Pin_6;
    GPIOC->CFGLR &= 0xF7FFFFFF; // to GPIO
    // Delay_Us(300);
    __disable_irq();
    TIM1->CHCTLR1 &= ~TIM_OCPreload_Enable;  // DIS OC1Preload
    TIM1->CH1CVR = 0;          // start with 0%PWM
    TIM1->CHCTLR1 |= TIM_OCPreload_Enable;  // EN OC1Preload
    TIM1->CNT = 0x0001;
    TIM1->CTLR1 |= TIM_CEN;     // start tim1
    GPIOC->CFGLR |= 0x08000000; // to TIMCC1 

    for(i = 0; i < data_len; i++){
        ws2812_send_Byte(*p_data);
        p_data++;
    }

    while(!(TIM1->INTFR & TIM_IT_Update)){}
    // ADD_N_NOPS(7);
    TIM1->INTFR &= 0xFFFE;
    TIM1->CTLR1 &= ~TIM_CEN;    // stop tim1
    TIM1->CH1CVR = 0;          // start with 0%PWM
    TIM1->CNT = 0x0001;
    GPIOC->BCR=GPIO_Pin_6;
    // GPIOC->BSHR=GPIO_Pin_6;
    GPIOC->CFGLR &= 0xF7FFFFFF; // to GPIO
    __enable_irq();
    // Delay_Us(300);
}

// #include <stdint.h>

void hsv_to_rgb(uint8_t h, uint8_t s, uint8_t v, uint8_t *p_save) {
    uint8_t r, g, b;

