Z2Z-GuGu/Snowflake-6/software/CH32V003/00_Test_GPIO - 副本/User/main.c
    if (s == 0) {
        // Achromatic (grey)
        r = g = b = v;
    } else {
        uint8_t region = h / 43; // 0-5 之间的区间
        uint8_t remainder = (h - (region * 43)) * 6; // (0-42) 转换为 (0-255)
        uint8_t p = (v * (255 - s)) >> 8; // v * (1 - s)
        uint8_t q = (v * (255 - ((s * remainder) >> 8))) >> 8; // v * (1 - s * remainder)
        uint8_t t = (v * (255 - ((s * (255 - remainder)) >> 8))) >> 8; // v * (1 - s * (255 - remainder))

        switch (region) {
            case 0: r = v; g = t; b = p; break;
            case 1: r = q; g = v; b = p; break;
            case 2: r = p; g = v; b = t; break;
            case 3: r = p; g = q; b = v; break;
            case 4: r = t; g = p; b = v; break;
            case 5: r = v; g = p; b = q; break;
        }
    }

    p_save[0] = r;
    p_save[1] = g;
    p_save[2] = b;
}

#define Value_MAX 100
#define Value_MIN 30
#define Saturation_MAX 200
#define Saturation_MIN 130
#define Hue_MAX 255
#define Hue_MIN 0
uint8_t Periodic_State = 0;
uint8_t Saturation = 130;   // 饱和度
uint8_t Value      = 0;     // 明度
uint8_t Hue        = 0;     // 色相
uint8_t Sat_Breath_State = 1;      // 
uint8_t Val_Breath_State = 0;      // 


uint8_t sin_val[7] = {0, 62, 120, 169, 207, 231, 240};  // 240*sin(15*i)

int8_t sind(int8_t angle)
{
    if(angle < 0 || angle > 24) return 0;
    if(angle >= 0 || angle <= 6) return sin_val[angle];
    if(angle > 6 || angle <= 12) return sin_val[12-angle];
    if(angle > 12 || angle <= 18) return -sin_val[angle-12];
    if(angle > 18 || angle <= 24) return -sin_val[24-angle];
}

int8_t cosd(int8_t angle)
{
    if(angle < 0 || angle > 24) return 0;
    if(angle >= 0 || angle <= 6) return sin_val[6-angle];
    if(angle > 6 || angle <= 12) return -sin_val[angle-6];
    if(angle > 12 || angle <= 18) return -sin_val[18-angle];
    if(angle > 18 || angle <= 24) return sin_val[angle-18];
}

typedef struct {
    int8_t angle;
    int8_t distance;
    int8_t x_value;
    int8_t y_value;
    int8_t direction;
} led_position_t;

// typedef struct {
//     int8_t h_value;
//     int8_t s_value;
//     int8_t v_value;
// } led_color_t;

led_position_t led_position[LED_NUM] = {0};
// led_color_t led_color[LED_NUM] = {0};

void led_position_init(void)
{
    int i;
    int temp16;
    for(i = 0; i < 6; i++){
        // angle
        led_position[i*5+0].angle = 22-4*i;
        led_position[i*5+1].angle = 22-4*i;
        led_position[i*5+2].angle = 23-4*i;
        led_position[i*5+3].angle = 22-4*i;
        led_position[i*5+4].angle = 21-4*i;
        // distance
        led_position[i*5+0].distance = 10;
        led_position[i*5+1].distance = 20;
        led_position[i*5+2].distance = 24;
        led_position[i*5+3].distance = 30;
        led_position[i*5+4].distance = 24;
        // direction
        led_position[i*5+0].direction = 1;
        led_position[i*5+1].direction = 0;
        led_position[i*5+2].direction = 1;
        led_position[i*5+3].direction = 1;
        led_position[i*5+4].direction = 1;
    }
    for(i = 0; i < LED_NUM; i++){
        temp16 = led_position[i].distance*cosd(led_position[i].angle)/240;
        led_position[i].x_value = temp16;
        temp16 = led_position[i].distance*sind(led_position[i].angle)/240;
        led_position[i].y_value = temp16;
    }
}

#define render_info_element_MAX 4

typedef struct {
    int8_t exist;
    int8_t type;    // 0:point(max=3) 1:ring(max=1)
    int8_t x_value;
    int8_t y_value;
    int8_t h_value;
    int8_t s_value;
    int8_t v_value;
} render_info_element_t;

render_info_element_t render_info_element[render_info_element_MAX] = {0};

void render_info_element_init(void)
{
    render_info_element[0].exist   =    1;
    render_info_element[0].type    =    0;
    render_info_element[0].x_value =    0;
    render_info_element[0].y_value =    0;
    render_info_element[0].h_value =    180;
    render_info_element[0].s_value =    100;
    render_info_element[0].v_value =    100;

    render_info_element[1].exist   =    0;
    render_info_element[1].type    =    0;
    render_info_element[1].x_value =    0;
    render_info_element[1].y_value =    0;
    render_info_element[1].h_value =    0;
    render_info_element[1].s_value =    0;
    render_info_element[1].v_value =    0;

    render_info_element[2].exist   =    0;
    render_info_element[2].type    =    0;
    render_info_element[2].x_value =    0;
    render_info_element[2].y_value =    0;
    render_info_element[2].h_value =    0;
    render_info_element[2].s_value =    0;
    render_info_element[2].v_value =    0;

    render_info_element[3].exist   =    1;
    render_info_element[3].type    =    1;
    render_info_element[3].x_value =    40;
    render_info_element[3].y_value =    40;
    render_info_element[3].h_value =    10;
    render_info_element[3].s_value =    100;
    render_info_element[3].v_value =    10;
}

void pixel_render_element(void)
{
    int i, j;
    int32_t W_param[4] = {0};
    int32_t temp32;
    for(i = 0; i < LED_NUM; i++){
        for(j = 0; j < 3; j++){
            if(render_info_element[j].exist){
                temp32 = led_position[i].x_value - render_info_element[j].x_value;
                W_param[j] = temp32*temp32;
                temp32 = led_position[i].y_value - render_info_element[j].y_value;
                W_param[j] += temp32*temp32;
            } else {
                W_param[j] = 0;
            }
        }
        temp32 = render_info_element[3].x_value - led_position[i].distance;
        W_param[3] = temp32*temp32;
        ws2812_hsv_data[i][0] = render_info_element[0].h_value;
        ws2812_hsv_data[i][1] = ((W_param[0]*render_info_element[0].s_value)+\
                                 (W_param[1]*render_info_element[1].s_value)+\
                                 (W_param[2]*render_info_element[2].s_value)+\
                                 (W_param[3]*render_info_element[3].s_value))/\
                                (W_param[0]+W_param[1]+W_param[2]+W_param[3]);
        ws2812_hsv_data[i][2] = ((W_param[0]*render_info_element[0].v_value)+\
                                 (W_param[1]*render_info_element[1].v_value)+\
                                 (W_param[2]*render_info_element[2].v_value)+\
                                 (W_param[3]*render_info_element[3].v_value))/\
                                (W_param[0]+W_param[1]+W_param[2]+W_param[3]);
    }
}

void pixels_hsv_to_RGB(void)
{
    uint8_t i = 0;
    for(i = 0; i < LED_NUM; i++){
        hsv_to_rgb( ws2812_hsv_data[i][0], \
                    ws2812_hsv_data[i][1], \
                    ws2812_hsv_data[i][2], \
                    &ws2812_sample_data[i][0]);
    }
}



int main(void)
{
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
    SystemCoreClockUpdate();
    Delay_Init();
    // ADC_IO_Init();
    SF_GPIO_INIT();
//    TIM1_INT_Init(250-1, 48000-1);      // 250ms
//    TIM_Cmd( TIM1, ENABLE );
    TIM2_INT_Init(16-1, 48000-1);       // 16ms
    TIM_Cmd( TIM2, ENABLE );
    DMA_INIT();
    USARTx_CFG();
    USART_DMACmd(USART1, USART_DMAReq_Rx, ENABLE);
    // Delay_Ms(1000);

   
    // TIM1_Dead_Time_Init(58, 0, 16);
    TIM1_Dead_Time_Init(58, 0, 0);
    while(1)
    {
        // test0:delay+gpiowrite
        // Delay_Ms(250);
        // GPIO_WriteBit(GPIOC, GPIO_Pin_0, 0);
        // Delay_Ms(250);
        // GPIO_WriteBit(GPIOC, GPIO_Pin_0, 1);

        // tesy1:delay+gpiowrite+read
        // Delay_Ms(250);
        // GPIO_WriteBit(GPIOC, GPIO_Pin_0, !GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_0));

        // test2 tim1/2+gpiowrite
        // GPIO_WriteBit(GPIOC, GPIO_Pin_0, tim_flag);

        // test3 TIM IRQ time:3.7us
        // GPIO_WriteBit(GPIOC, GPIO_Pin_0, !GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_0)); // 1.2/1.3us
        // GPIO_WriteBit(GPIOC, GPIO_Pin_0, 0); // 0.5us
        // GPIO_WriteBit(GPIOC, GPIO_Pin_0, 1); // 0.8us

        // test4 nop time
        // GPIO_WriteBit(GPIOC, GPIO_Pin_0, 0); // 0.5us
        // ADD_N_NOPS(100);                     // 4.14us
        // GPIO_WriteBit(GPIOC, GPIO_Pin_0, 1); // 0.8us
        // ADD_N_NOPS(200);                     // 8.28us

