Z2Z-GuGu/Snowflake-6/software/CH32V003/00_Test_GPIO - 副本/User/main.c
        // test5 uart send
        // USART_SendData(USART1, 0x55);
        // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET)
        // {
        //     // waiting for sending finish
        // }
        // Delay_Ms(250);

        // test6 uart r+s        
        // while(USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == RESET)
        // {
        //     // waiting for receiving finish
        // }
        // uart_data = (USART_ReceiveData(USART1));
        // USART_SendData(USART1, uart_data);
        // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET)
        // {
        //     // waiting for sending finish 
        // }

        // test7 uart interrupt
        // if(uart_flag == 1){
        //     USART_SendData(USART1, uart_data);
        //     while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET)
        //     {
        //        // waiting for sending finish
        //     }
        //     uart_flag = 0;
        // } 
        // // 外边必须有东西，不然按目前的优化程度直接被优化了，不被执行
        // Delay_Ms(1);

        // test8 uart DMA
        // while(DMA_GetFlagStatus(DMA1_FLAG_TC5) == RESET) // Wait until USART1 RX DMA1 Transfer Complete
        // {
        //     // USART_SendData(USART1, 0x55);
        //     // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        // }
        // DMA_ClearFlag(DMA1_FLAG_TC5);
        // USART_SendData(USART1, uart_data_buf[0]);
        // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        // USART_SendData(USART1, uart_data_buf[1]);
        // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        // USART_SendData(USART1, uart_data_buf[2]);
        // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        // USART_SendData(USART1, uart_data_buf[3]);
        // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        // USART_SendData(USART1, uart_data_buf[4]);
        // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        // USART_SendData(USART1, uart_data_buf[5]);
        // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        // USART_SendData(USART1, uart_data_buf[6]);
        // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        // USART_SendData(USART1, uart_data_buf[7]);
        // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        // USART_SendData(USART1, uart_data_buf[8]);
        // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        // USART_SendData(USART1, uart_data_buf[9]);
        // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}

        // start_one_DMA();

        // test9 uart dma irq
        // if(uart_flag == 1){
        //     uart_flag = 0;
        //     DMA_ClearFlag(DMA1_FLAG_TC5);

        //     USART_SendData(USART1, uart_data_buf[0]);
        //     while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        //     USART_SendData(USART1, uart_data_buf[1]);
        //     while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        //     USART_SendData(USART1, uart_data_buf[2]);
        //     while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        //     USART_SendData(USART1, uart_data_buf[3]);
        //     while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        //     USART_SendData(USART1, uart_data_buf[4]);
        //     while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        //     USART_SendData(USART1, uart_data_buf[5]);
        //     while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        //     USART_SendData(USART1, uart_data_buf[6]);
        //     while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        //     USART_SendData(USART1, uart_data_buf[7]);
        //     while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        //     USART_SendData(USART1, uart_data_buf[8]);
        //     while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        //     USART_SendData(USART1, uart_data_buf[9]);
        //     while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}

        //     start_one_DMA();
        // }
        // Delay_Ms(1);

        // test10 ADC read
        // printf("====================================\r\n");
        // printf("adc0 data = %d\r\n", Get_ADC_Val(ADC_Channel_0));
        // printf("adc1 data = %d\r\n", Get_ADC_Val(ADC_Channel_1));
        // printf("adc2 data = %d\r\n", Get_ADC_Val(ADC_Channel_2));
        // printf("adc3 data = %d\r\n", Get_ADC_Val(ADC_Channel_3));
        // printf("adc4 data = %d\r\n", Get_ADC_Val(ADC_Channel_4));
        // printf("adc7 data = %d\r\n", Get_ADC_Val(ADC_Channel_7));
        // Delay_Ms(1000);

        // test11 ws2812
        // int i = 0;
        // uint8_t ws2812_data = 0x55;
        // ws2812_send_bit(ws2812_data&0x01);
        // ws2812_send_bit(ws2812_data&0x02);
        // ws2812_send_bit(ws2812_data&0x04);
        // ws2812_send_bit(ws2812_data&0x08);
        // ws2812_send_bit(ws2812_data&0x10);
        // ws2812_send_bit(ws2812_data&0x20);
        // ws2812_send_bit(ws2812_data&0x40);
        // ws2812_send_bit(ws2812_data&0x80);
        // Delay_Ms(1);

        // test12 PWM
        // USART_SendData(USART1, TIM1->CNT);
        // while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET){}
        // Delay_Ms(1);
        // while(TIM1->CNT < 50){}

        // test13 PWM chg
        // while(!(TIM1->INTFR & TIM_IT_Update)){}
        // TIM1->CH1CVR = 44;
        // TIM1->INTFR &= 0xFFFE;
        // while(!(TIM1->INTFR & TIM_IT_Update)){}
        // TIM1->CH1CVR = 16;
        // TIM1->INTFR &= 0xFFFE;

        // test14 gpio out <-> af
        // GPIOC->BSHR=GPIO_Pin_6;     // 1
        // GPIOC->CFGLR &= 0xF7FFFFFF; // to GPIO
        // Delay_Ms(1);
        // GPIOC->CFGLR |= 0x08000000; // to TIMCC1
        // Delay_Ms(1);
        // GPIOC->BCR=GPIO_Pin_6;      // 0
        // GPIOC->CFGLR &= 0xF7FFFFFF; // to GPIO
        // Delay_Ms(1);
        // GPIOC->CFGLR |= 0x08000000; // to TIMCC1
        // Delay_Ms(1);

        // test15 ws2812 send
        // ws2812_send_Byte(0x0F);

        // test16 ws send start&stop
        // GPIOC->BCR=GPIO_Pin_6;
        // GPIOC->CFGLR &= 0xF7FFFFFF; // to GPIO
        // Delay_Us(300);
        // TIM1->CHCTLR1 &= ~TIM_OCPreload_Enable;  // DIS OC1Preload
        // TIM1->CH1CVR = 0;          // start with 0%PWM
        // TIM1->CHCTLR1 |= TIM_OCPreload_Enable;  // EN OC1Preload
        // TIM1->CNT = 0x0001;
        // TIM1->CTLR1 |= TIM_CEN;     // start tim1
        // GPIOC->CFGLR |= 0x08000000; // to TIMCC1
        // ws2812_send_Byte(0x0F);
        // while(!(TIM1->INTFR & TIM_IT_Update)){}
        // // ADD_N_NOPS(7);
        // TIM1->INTFR &= 0xFFFE;
        // TIM1->CTLR1 &= ~TIM_CEN;    // stop tim1
        // TIM1->CH1CVR = 0;          // start with 0%PWM
        // TIM1->CNT = 0x0001;
        // GPIOC->BCR=GPIO_Pin_6;
        // // GPIOC->BSHR=GPIO_Pin_6;
        // GPIOC->CFGLR &= 0xF7FFFFFF; // to GPIO
        // Delay_Us(300);

