Z2Z-GuGu/Snowflake-6/software/CH32V003/00_Test_GPIO - 副本/User/main.c
        // test17 ws2812 send data
        // GPIOC->BSHR=GPIO_Pin_0;     // 1
        // ws2812_send_data(ws2812_sample_data, LED_NUM*PIXEL_SIZE);
        // GPIOC->BCR=GPIO_Pin_0;      // 0

        // test18 hsv to rgb time   // 30~2.35us
//        if(Periodic_State == 1){
//            // 亮度呼吸
//            if(Value >= Value_MAX) Val_Breath_State = 0;
//            else if(Value <= Value_MIN) Val_Breath_State = 1;
//            if(Val_Breath_State) Value += 1;
//            else Value -= 1;
//            // 饱和呼吸
//            if(Saturation >= Saturation_MAX) Sat_Breath_State = 0;
//            else if(Saturation <= Saturation_MIN) Sat_Breath_State = 1;
//            if(Sat_Breath_State) Saturation += 1;
//            else Saturation -= 1;
//            // 色相轮转
//            if(Hue == Hue_MAX) Hue = Hue_MIN;
//            else Hue++;
//            uint8_t i = 0;
//            for(i = 0; i < LED_NUM; i++){
//                // if((i+0)%5 == 0) // only innerlight
//                // if((i+1)%5 == 0) // only rightlight
//                // if((i+2)%5 == 0) // only toplight
//                // if((i+3)%5 == 0) // only leftlight
//                if((i+4)%5 == 0) // only backlight
//                // if((i+3)%5 == 0 || (i+1)%5 == 0 || (i+0)%5 == 0 || (i+2)%5 == 0)
//                    hsv_to_rgb(Hue+(8*i), Saturation, Value, &ws2812_sample_data[i][0]);
//                else
//                    hsv_to_rgb(0, 0, 0, &ws2812_sample_data[i][0]);
//            }
//            ws2812_send_data(ws2812_sample_data, LED_NUM*PIXEL_SIZE);
//            // Delay_Us(1000);
//            Periodic_State = 0;
//        }
//         Delay_Us(1);

        // test19 运算时间
        // float  *  = 1.7us
        // float  /  = 2.0us
        // uint32 *  = 41ns
        // uint32 /  = 41ns

        // uint32_t i;
        // uint16_t a,b,c;
        // GPIOC->BSHR=GPIO_Pin_0;     // 1
        // for(i = 0; i < 1000; i++){
        //     c+=a+b;
        // }
        // GPIOC->BCR=GPIO_Pin_0;      // 0
        // printf("c = %d", c);

         // test20 rander
        if(Periodic_State == 1){
          GPIO_WriteBit(GPIOC, GPIO_Pin_1, 1);
          pixel_render_element();
          pixels_hsv_to_RGB();
          ws2812_send_data(ws2812_sample_data, LED_NUM*PIXEL_SIZE);
          GPIO_WriteBit(GPIOC, GPIO_Pin_1, 0);
          Periodic_State = 0;
        }
        Delay_Us(1);
    }
}

// void TIM1_UP_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
// void TIM1_UP_IRQHandler(void)
// {
//     if(TIM_GetITStatus(TIM1, TIM_IT_Update)==SET)
//     {
//         tim_flag = !tim_flag;
//     }
//     TIM_ClearITPendingBit( TIM1, TIM_IT_Update );
// }

void TIM2_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void TIM2_IRQHandler(void)
{
    if(TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET) //检查TIM2中断是否发生。
    {
        // tim_flag = !tim_flag;
         GPIO_WriteBit(GPIOC, GPIO_Pin_1, !GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_1));
        Periodic_State = 1;
        TIM_ClearITPendingBit(TIM2,TIM_IT_Update);      //清除TIM2的中断挂起位。
    }
}

void USART1_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void USART1_IRQHandler(void)
{
    if(USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)
    {
        uart_data = USART_ReceiveData(USART1);
        uart_flag = 1;
    }
}

void DMA1_Channel5_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void DMA1_Channel5_IRQHandler(void)
{
    if( DMA_GetITStatus(DMA1_IT_TC5) != RESET )
    {
        uart_flag = 1;
        DMA_ClearITPendingBit(DMA1_IT_TC5);
    }
}

